[
  {
    "id": "ubs_report::s0::c0",
    "doc_id": "ubs_report",
    "text": "<figure>\n\nUBS\n\n</figure>\n\n\n<!-- PageHeader=\"Investor Relations Tel. +41-44-234 41 00\" -->\n<!-- PageHeader=\"Media Relations Tel. +41-44-234 85 00\" -->\n\nAd hoc announcement pursuant to Article 53 of the SIX Exchange Regulation Listing Rules",
    "section_title": null,
    "section_level": 0,
    "section_breadcrumb": []
  },
  {
    "id": "ubs_report::s1::c0",
    "doc_id": "ubs_report",
    "text": "...<!-- PageHeader=\"Investor Relations Tel. +41-44-234 41 00\" -->\n<!-- PageHeader=\"Media Relations Tel. +41-44-234 85 00\" -->\n\nAd hoc announcement pursuant to Article 53 of the SIX Exchange Regulation Listing Rules\n\n[UBS reports strong results in 3Q25 with continued progress on integration]\n\n# UBS reports strong results in 3Q25 with continued progress on integration\n\n\"We delivered an excellent 3Q25 financial performance powered by significant momentum in our core businesses\nand disciplined execution of our strategic priorities. We've seen strong private and institutional client activity with\ninvested assets reaching nearly 7 trillion. As a key pillar of our strategy, our balance sheet for all seasons remains\nstrong, allowing us to invest in talent, technology, and capabilities as we continue to make further progress on\nintegration, positioning us for long-term growth and value creation.\"\n\nSergio P. Ermotti, Group CEO\n\n3Q25 PBT of USD 2.8bn and underlying1 PBT of\nUSD 3.6bn, net profit of USD 2.5bn, RoCET1 of\n13.5% and underlying RoCET1 of 16.3%. Core\nbusinesses2 underlying PBT up by 28% YoY, or 19%\nexcluding litigation\n\nStrong client momentum with quarterly asset inflows\nsupporting 4% sequential growth in Group invested assets\nto USD 6.9trn. Global Wealth Management net new\nassets of USD 38bn driving year-to-date NNA of USD 92bn.\nAsset Management invested assets passed the USD 2trn\nmark helped by USD 18bn in net new money in 3Q25\n\nStrong trading and deal activity leveraging favorable\nenvironment. On underlying basis Global Wealth\nManagement 3Q25 transaction-based income up 11%\nYoY, record third quarter for both Global Banking, up\n52% YoY, and Global Markets, up 14% YoY\n\nExcellent progress on integration with over two-thirds\nof Swiss-booked client accounts already migrated;\nsubstantially completed the integration of Asset\nManagement. Delivered further USD 0.9bn in exit rate\ngross cost saves in the quarter bringing cumulative cost\nreductions to USD 10bn, one quarter ahead of schedule.\nThis represents 77% of the USD ~13bn in expected\ngross saves by end-2026\n\nReliable partner for the Swiss economy, staying close\nto private clients and businesses. We are supporting them\nwith our leading credit offering and unique global\ncapabilities and footprint. Granted or renewed around\nCHF 40bn of loans during the quarter\n\nProgress on Non-core and Legacy wind-down and\nlitigation; active position exits contributing to a\nUSD 1.9bn sequential reduction in risk-weighted assets to\nUSD 30.7bn. Resolution of legacy UBS and Credit Suisse\nlegal matters leading to Group net litigation reserve\nreleases of USD 668m\n\nBalance sheet for all seasons with 14.8% CET1 capital\nratio, 4.6% CET1 leverage ratio, and continued execution\non our capital return plans. Completed USD 1.1bn in\nshare buybacks in 3Q25. With up to USD 0.9bn in\nrepurchases planned for 4Q25 we are set to reach the\nUSD 3bn total for 2025. Continued accruing for a\ndouble-digit growth in dividend\n\nPositioning for long-term growth by investing\nstrategically and executing on our plans. Submitted\nNational Bank Charter application in the US. Sustained\ninvestments in Gen AI drive its usage and adoption across\nthe firm. Continuing to contribute to the ongoing\npolitical process on banking regulation in Switzerland\n\n2.5bn\nUSD\n\n13.5%\n\nJSD 2.8bn\nProfit before tax\n\n77.0%\n\n14.8%\n\nNet profit\n\nRoCET1 capital\n\nCost/income ratio\n\nCET1 capital ratio\n\nUSD 0.76\nDiluted EPS\n\n16.3%\nUnderlying1\nRoCET1 capital\n\nUSD 3.6bn\nUnderlying1\nprofit before tax\n\n69.7%\nUnderlying1\ncost/income ratio\n\n4.6%\n\nCET1 leverage ratio\n\nInformation in this news release is presented for UBS Group AG on a consolidated basis unless otherwise specified. 1 Underlying results exclude items of profit or loss that management\nbelieves are not representative of the underlying performance. Underlying results are a non-GAAP financial measure and alternative performance measure (APM). Refer to \"Group\nPerformance\" and \"Appendix-Alternative Performance Measures\" in the financial report for the third quarter of 2025 for a reconciliation of underlying to reported results and definitions of the\nAPMs. 2 Includes Global Wealth Management, Personal & Corporate Banking, Asset Management, the Investment Bank, and Group Items.",
    "section_title": "UBS reports strong results in 3Q25 with continued progress on integration",
    "section_level": 1,
    "section_breadcrumb": [
      "UBS reports strong results in 3Q25 with continued progress on integration"
    ]
  },
  {
    "id": "ubs_report::s1::c1",
    "doc_id": "ubs_report",
    "text": "...reconciliation of underlying to reported results and definitions of the\nAPMs. 2 Includes Global Wealth Management, Personal & Corporate Banking, Asset Management, the Investment Bank, and Group Items.\n\n<!-- PageFooter=\"UBS Group AG, Media Release, 29 October 2025\" -->\n<!-- PageNumber=\"Page 1 of 17\" -->\n<!-- PageBreak -->\n\n\n<figure>\n\nUBS\n\n</figure>\n\n\n<!-- PageHeader=\"Investor Relations Tel. +41-44-234 41 00\" -->\n<!-- PageHeader=\"Media Relations Tel. +41-44-234 85 00\" -->",
    "section_title": "UBS reports strong results in 3Q25 with continued progress on integration",
    "section_level": 1,
    "section_breadcrumb": [
      "UBS reports strong results in 3Q25 with continued progress on integration"
    ]
  },
  {
    "id": "ubs_report::s2::c0",
    "doc_id": "ubs_report",
    "text": "...<figure>\n\nUBS\n\n</figure>\n\n\n<!-- PageHeader=\"Investor Relations Tel. +41-44-234 41 00\" -->\n<!-- PageHeader=\"Media Relations Tel. +41-44-234 85 00\" -->\n\n[UBS reports strong results in 3Q25 with continued progress on integration > Group summary]\n\n## Group summary",
    "section_title": "Group summary",
    "section_level": 2,
    "section_breadcrumb": [
      "UBS reports strong results in 3Q25 with continued progress on integration",
      "Group summary"
    ]
  },
  {
    "id": "ubs_report::s3::c0",
    "doc_id": "ubs_report",
    "text": "...## Group summary\n\n[UBS reports strong results in 3Q25 with continued progress on integration > Group summary > Strong financial performance]\n\n### Strong financial performance\n\nIn 3Q25, we reported profit before tax of USD 2,828m and underlying PBT of USD 3,590m, up 47% and 50% YoY,\nrespectively. Results were driven by growth in our core businesses, which increased their combined underlying PBT excluding\nlitigation by 19% YoY. Net profit attributable to shareholders was USD 2,481m, up 74% YoY and included net litigation\nreserve releases of USD 668m, mainly due to the resolution of legal matters related to Credit Suisse's Residential Mortgage-\nBacked Securities (RMBS) business and UBS's legacy cross-border activities in France. Return on CET1 capital was 13.5%,\nor 16.3% on an underlying basis. Diluted earnings per share were USD 0.76, up 77% YoY.\n\nReported revenues were USD 12,760m, up 3% YoY. On an underlying basis, revenues increased by 5% to USD 12,199m.\nUnderlying revenues from our core businesses increased 7%, reflecting the enduring advantages of our diversified global\nplatform and broad-based client momentum amid constructive markets. Underlying revenues in Non-core and Legacy\ndivision declined by USD 304m from 3Q24, reflecting NCL progress in significantly reducing the size of its portfolio.\n\nReported Group operating expenses decreased by 4% YoY to USD 9,831m.",
    "section_title": "Strong financial performance",
    "section_level": 3,
    "section_breadcrumb": [
      "UBS reports strong results in 3Q25 with continued progress on integration",
      "Group summary",
      "Strong financial performance"
    ]
  },
  {
    "id": "ubs_report::s4::c0",
    "doc_id": "ubs_report",
    "text": "...Underlying revenues in Non-core and Legacy\ndivision declined by USD 304m from 3Q24, reflecting NCL progress in significantly reducing the size of its portfolio.\n\nReported Group operating expenses decreased by 4% YoY to USD 9,831m.\n\n[UBS reports strong results in 3Q25 with continued progress on integration > Group summary > Continued momentum in client inflows and trading activity]\n\n### Continued momentum in client inflows and trading activity\n\nWe have been supporting clients with advice helping them benefit from constructive market conditions. This drove strong\nmomentum across our businesses, including asset flows and transactional activity.\n\nGroup invested assets rose 4% sequentially to USD 6.9trn, driven by growth across Global Wealth Management, Asset\nManagement and Personal & Corporate Banking. In GWM net new assets reached USD 38bn with strong generation in\nAPAC, EMEA and Switzerland more than offsetting outflows in the Americas, primarily reflecting advisor movement\nfollowing the structural changes we introduced last year, as part of the franchise's broader realignment. With NNA of\nUSD 92bn year-to-date, we are already close to our full-year ambition of USD 100bn. Asset Management net new money\nreached USD 18bn with net inflows across all asset classes, helping invested assets top the USD 2trn mark for the first time.\n\nTransactional activity during the quarter remained strong among both private and institutional clients, led in particular by\nstrength in APAC. Our strategic focus and scale paired with deep and holistic coverage allowed us to capture client and\nmarket activity in the region. In wealth management, underlying transaction-based income rose 28% YoY, while the\nInvestment Bank delivered its highest quarterly revenues on record driven by broad-based gains across both Global Banking\nand Global Markets. It was also recently named the best Investment Bank in Asia by Euromoney.\n\nIn GWM, on an underlying basis, third-quarter transaction-based income increased by 11% YoY with the standout APAC\nperformance supported by positive momentum across other regions. In the Investment Bank, underlying Global Banking\nrevenues grew 52% YoY to USD 0.8bn with gains led by Advisory and Capital Markets, outperforming fee pools in line\nwith our medium-to-long term ambitions to increase market share.\n\nGlobal Markets underlying revenues of USD 2.2bn were up 14% YoY, underpinned by strength in our areas of focus within\nEquities and Foreign Exchange, Rates and Credit, including cash equities, Prime Brokerage, and FX.\n\nIn P&C's Personal Banking franchise we also saw robust activity, with transaction-based revenues up 10% YOY, supported\nby deeper client engagement. Positive net new client assets, reflecting increased adoption of our discretionary solutions,\ncontributed to the 6% increase in recurring net fee income.",
    "section_title": "Continued momentum in client inflows and trading activity",
    "section_level": 3,
    "section_breadcrumb": [
      "UBS reports strong results in 3Q25 with continued progress on integration",
      "Group summary",
      "Continued momentum in client inflows and trading activity"
    ]
  },
  {
    "id": "ubs_report::s5::c0",
    "doc_id": "ubs_report",
    "text": "...Positive net new client assets, reflecting increased adoption of our discretionary solutions,\ncontributed to the 6% increase in recurring net fee income.\n\n[UBS reports strong results in 3Q25 with continued progress on integration > Group summary > Reliable partner for the Swiss economy]\n\n### Reliable partner for the Swiss economy\n\nBusinesses and households in Switzerland benefit from our global reach, advice and expertise. Importantly, our balance\nsheet for all seasons gives our clients the stability they need while allowing us to remain a leading provider of credit to the\neconomy. We have granted or renewed CHF 40bn of loans during the quarter.\n\nOur conservative approach to risk and highly robust business model is reflected in the Group's loan-to-deposit ratio of 83%\nand cost of risk of only 6bps.\n\n<!-- PageFooter=\"UBS Group AG, Media Release, 29 October 2025\" -->\n<!-- PageNumber=\"Page 2 of 17\" -->",
    "section_title": "Reliable partner for the Swiss economy",
    "section_level": 3,
    "section_breadcrumb": [
      "UBS reports strong results in 3Q25 with continued progress on integration",
      "Group summary",
      "Reliable partner for the Swiss economy"
    ]
  }
]